---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.Projection
source: html/ee91834d-13b3-ffeb-7f6b-3638e18b396c.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.Projection Property

The horizontal distance between the outer boundary of the rail and the path.

## Syntax (C#)
```csharp
public double Projection { get; }
```